IDEA StatiCa Open Model
MatSteelRUS.fy Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Yield strength
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double fy { get; set; }
Public Property fy As Double
	Get
	Set
public:
property double fy {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
MatSteelRUS Class
IdeaRS.OpenModel.Material Namespace